[
    {
      "title": "Therapeutic Massage & Bodywork",
      "services": [
        {
          "name": "Swedish Relaxation",
          "duration": "$145 (60 min) or  $220 (90 min)",
          "description": "A traditional massage that focuses on relaxing the body through gentle techniques that improve circulation, relieves muscle tension and promotes overall well-being. This massage is often used to ease stress."
        },
        {
          "name": "Deep Tissue Recovery",
          "duration": "$170 (60 min) or  $255 (90 min)",
          "description": "Targeting deeper layers of the muscle and connective tissue, this massage is curated for those seeking a release from chronic patterns of tension and pain by addressing the root cause. Techniques used but not limited to include myofascial release, pinch and pull, trigger point therapy as well as slow strokes with firm pressure. From athletes with sports related injuries or to the person who simply feels overworked you are bound to find relief with this massage."
        },
        {
          "name": "Dreamscape Massage",
          "duration": "$185 (60 min) or  $245 (90 min)",
          "description": "A treatment with the intention of putting you in a deep state of relaxation. This session begins with a head massage that progresses down to the face and neck targeting high tension points using cold stones along with aromatherapy inhalation. From there we then treat the rest of the body. Swedish massage techniques are primarily used that are traditionally lighter in pressure. This is for the person looking to drift away from life stresses here by the beach."
        },
        {
          "name": "CBD Bliss",
          "duration": "$200 (60 min) or  $300 (90 min)",
          "description": "A relaxing treatment that uses Full Spectrum Spagyric (spuh-jeer-ik) CBD oil, with your choice of scent (Lavender, Orange Blossom, Lemongrass or Unscented), to alleviate pain and inflammation to the fullest. Spagyric CBD extracts are the fullest full spectrum available on the market to date. This treatment also includes a serving of 25mg broad spectrum CBD gummies. If you are looking to calm your body and mind while seeking immediate relief from pains and aches then this is for you."
        }
      ]
    }
  ]
  